In [48]:
import pandas as pd

In [49]:
friends_s1 = pd.DataFrame({"character":["RG", "RoG", "PB", "JT", "MG", "CB"], "name":["JA", "DS", "LK", "ML", "CC", "MP"], "BD": ["1969-02-11", "1966-11-02", "1963-07-30", "1967-07-25", "1964-06-15", "1969-08-19"]})

In [50]:
display(friends_s1)

  character name          BD
0        RG   JA  1969-02-11
1       RoG   DS  1966-11-02
2        PB   LK  1963-07-30
3        JT   ML  1967-07-25
4        MG   CC  1964-06-15
5        CB   MP  1969-08-19

In [51]:
friends_s2 = pd.DataFrame({"character_name": ["RG", "RoG", "PB", "JT", "MG", "CB", "RB", "G", "EW", "MH"], "gender": ["f", "m", "f", "m", "f", "m", "m", "m", "f", "m"]})

In [52]:
display(friends_s2)

  character_name gender
0             RG      f
1            RoG      m
2             PB      f
3             JT      m
4             MG      f
5             CB      m
6             RB      m
7              G      m
8             EW      f
9             MH      m

In [53]:
friends_left = friends_s1.merge(friends_s2, how='left', left_on='character', right_on='character_name')

In [54]:
display(friends_left)

  character name          BD character_name gender
0        RG   JA  1969-02-11             RG      f
1       RoG   DS  1966-11-02            RoG      m
2        PB   LK  1963-07-30             PB      f
3        JT   ML  1967-07-25             JT      m
4        MG   CC  1964-06-15             MG      f
5        CB   MP  1969-08-19             CB      m

In [55]:
friends_inner = friends_s1.merge(friends_s2, how='inner', left_on='character', right_on='character_name')

In [56]:
display(friends_inner)

  character name          BD character_name gender
0        RG   JA  1969-02-11             RG      f
1       RoG   DS  1966-11-02            RoG      m
2        PB   LK  1963-07-30             PB      f
3        JT   ML  1967-07-25             JT      m
4        MG   CC  1964-06-15             MG      f
5        CB   MP  1969-08-19             CB      m

In [57]:
friends_inner.shape

(6, 5)

In [58]:
friends_right = friends_s1.merge(friends_s2, how='right', left_on='character', right_on='character_name')

In [59]:
friends_right.shape

(10, 5)

In [60]:
df_A = pd.DataFrame()
df_A["Name"] = ["Kawsar", "Tasnim", "Jakir"]
df_A["Address"] = ["Houston", "Boise", "Tampa"]
df_A["University"] = ["USF", "BSU", "USF"]

In [61]:
display(df_A)

     Name  Address University
0  Kawsar  Houston        USF
1  Tasnim    Boise        BSU
2   Jakir    Tampa        USF

In [62]:
df_B = pd.DataFrame({"Name":["Kawsar", "Tasnim", "Riad"], 
                     "Department": ["EEE", "CSE", "EEE"]})

display(df_B)

     Name Department
0  Kawsar        EEE
1  Tasnim        CSE
2    Riad        EEE

In [63]:
df_A.set_index('Name')

        Address University
Name
Kawsar  Houston        USF
Tasnim    Boise        BSU
Jakir     Tampa        USF

In [64]:
df_B.set_index('Name')

       Department
Name
Kawsar        EEE
Tasnim        CSE
Riad          EEE

In [65]:
df_inner = df_A.merge(df_B, how='inner', left_index=True, right_index=True)

In [66]:
df_inner.shape

(3, 5)

In [67]:
display(df_inner)

   Name_x  Address University  Name_y Department
0  Kawsar  Houston        USF  Kawsar        EEE
1  Tasnim    Boise        BSU  Tasnim        CSE
2   Jakir    Tampa        USF    Riad        EEE

In [68]:
df_inner_1 = df_A.merge(df_B, how='inner')

In [69]:
display(df_inner_1)

     Name  Address University Department
0  Kawsar  Houston        USF        EEE
1  Tasnim    Boise        BSU        CSE

In [70]:
friends_left = friends_s1.merge(friends_s2, how='left', left_on='character', right_on='character_name')
display(friends_left)

  character name          BD character_name gender
0        RG   JA  1969-02-11             RG      f
1       RoG   DS  1966-11-02            RoG      m
2        PB   LK  1963-07-30             PB      f
3        JT   ML  1967-07-25             JT      m
4        MG   CC  1964-06-15             MG      f
5        CB   MP  1969-08-19             CB      m

In [71]:
friends_left.shape

(6, 5)

In [72]:
df_inner_2 = df_A.merge(df_B, how='inner', left_index=True, right_index=True)

In [73]:
display(df_inner_2)

   Name_x  Address University  Name_y Department
0  Kawsar  Houston        USF  Kawsar        EEE
1  Tasnim    Boise        BSU  Tasnim        CSE
2   Jakir    Tampa        USF    Riad        EEE

In [74]:
friends_right = friends_s1.merge(friends_s2, how='right', left_on='character', right_on='character_name')

In [75]:
display(friends_right)

  character name          BD character_name gender
0        RG   JA  1969-02-11             RG      f
1       RoG   DS  1966-11-02            RoG      m
2        PB   LK  1963-07-30             PB      f
3        JT   ML  1967-07-25             JT      m
4        MG   CC  1964-06-15             MG      f
5        CB   MP  1969-08-19             CB      m
6       NaN  NaN         NaN             RB      m
7       NaN  NaN         NaN              G      m
8       NaN  NaN         NaN             EW      f
9       NaN  NaN         NaN             MH      m

In [76]:
friends_outer = friends_s1.merge(friends_s2, how='outer', left_on='character', right_on='character_name')

In [77]:
display(friends_outer)

  character name          BD character_name gender
0        RG   JA  1969-02-11             RG      f
1       RoG   DS  1966-11-02            RoG      m
2        PB   LK  1963-07-30             PB      f
3        JT   ML  1967-07-25             JT      m
4        MG   CC  1964-06-15             MG      f
5        CB   MP  1969-08-19             CB      m
6       NaN  NaN         NaN             RB      m
7       NaN  NaN         NaN              G      m
8       NaN  NaN         NaN             EW      f
9       NaN  NaN         NaN             MH      m

In [78]:
friends_outer.shape

(10, 5)